# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [1]:
import pandas as pd

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [3]:
# a = 
a = pd.Series([100,200,300,400])

Print a, and data type

In [4]:
print(a)
print(a.dtype)

0    100
1    200
2    300
3    400
dtype: int64
int64

Using indexing access the element 300 from the series a.

In [5]:
print(a[2])

300

What are the values of index for series a?

In [6]:
print(a)

0    100
1    200
2    300
3    400
dtype: int64

Change the index to  ['c', 'a', 'b', 'd']

In [76]:
a = pd.Series([100,200,300,400], index=['c','a','b','d'])
a

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [77]:
print(a['d'])

400

Sort the values wrt to the index and print it

In [78]:
sorted_index = a.sort_index()
print(sorted_index)

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [79]:
# b = 
b = pd.Series(['800','450','100'], index=['e','f','g'])
b

e    800
f    450
g    100
dtype: object

Append b series at the end of a series

In [84]:
# a =
#new=a.append(b)
#print(new)
a = pd.concat([a,b])
print(a)

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: object

In [96]:
#print a again after appending b into it
print(a)

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: object

Sort the values in descending order of a and print the index of the sorted series

In [97]:
# a = 
sorted_a = a.sort_values(ascending=False)
print(sorted_a.index)

TypeError: '<' not supported between instances of 'int' and 'str'

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [98]:
# df = 
df = pd.DataFrame(a, columns = ['Values'])
df

  Values
c    100
a    200
b    300
d    400
e    800
f    450
g    100

What is the shape of the datafarme <br>
(also, what does it imply?)

In [99]:
df.shape

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [100]:
# yep its same as the series.

df.index

Index(['c', 'a', 'b', 'd', 'e', 'f', 'g'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [101]:
df.head()
# it represent first 5 records.

  Values
c    100
a    200
b    300
d    400
e    800

In [102]:
df.tail()

  Values
b    300
d    400
e    800
f    450
g    100

Rename the column of the dataframe as 'points'

In [116]:

df = pd.DataFrame(a,columns=['points'])

df

  points
c    100
a    200
b    300
d    400
e    800
f    450
g    100

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [117]:
#Create fruits array

# fruits =
fruits = ['orange', 'apple','banana','cherry','papaya','pineapple','mango']
fruits

['orange', 'apple', 'banana', 'cherry', 'papaya', 'pineapple', 'mango']

In [118]:
#Create series fruits out of fruits array

# fruits =
fruits_series = pd.Series(fruits)
print(fruits_series)

0       orange
1        apple
2       banana
3       cherry
4       papaya
5    pineapple
6        mango
dtype: object

Change the index of fruits to the index of dataframe df

In [119]:
fruits_series.index= df.index
print(fruits_series)

c       orange
a        apple
b       banana
d       cherry
e       papaya
f    pineapple
g        mango
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [120]:

df['fruits'] = fruits_series

df

  points     fruits
c    100     orange
a    200      apple
b    300     banana
d    400     cherry
e    800     papaya
f    450  pineapple
g    100      mango

In [121]:
df.head()

  points  fruits
c    100  orange
a    200   apple
b    300  banana
d    400  cherry
e    800  papaya

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [16]:
# d1 = 
d1= pd.DataFrame({
    'city':['Chandigarh','Delhi','Kanpur','Chennai','Manali'],
    'Temperature':[15,22,20,26,-2]
})
d1

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

Print(d1)

In [17]:
print(d1)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [18]:
d1.shape

(5, 2)

Set city = d1['city']

In [19]:
city= d1['city']

print city <br>
What is the type of city.

In [21]:
type(city)

pandas.core.series.Series

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [22]:
# d2 = 
d2= pd.DataFrame({
    'city':['Bengaluru','Coimbatore','Srirangam','Pondicherry'],
    'Temperature':[24,35,36,39]
})
d2

          city  Temperature
0    Bengaluru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

print the shape of this dataframe

In [24]:
d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [27]:
# d3 = 

d3 = pd.concat([d1, d2], axis=0)
d3

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengaluru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [28]:
d3[d3['Temperature'] <= 20][['city']]

         city
0  Chandigarh
2      Kanpur
4      Manali

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [29]:
d3[d3['Temperature'] >= 35][['city']]

          city
1   Coimbatore
2    Srirangam
3  Pondicherry

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [140]:
# write function here

# def is_ut(x):
    
#     # write code below
    
# d3['is_ut'] = 
union_territories = ['Chandigarh', 'Pondicherry','Delhi']
def is_ut(x):
    return x in union_territories

d3['is_ut'] = d3['city'].apply(is_ut)
print(d3)

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            59.0
1        Delhi           22   True            71.6
2       Kanpur           20  False            68.0
3      Chennai           26  False            78.8
4       Manali           -2  False            28.4
0    Bengaluru           24  False            75.2
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  Pondicherry           39   True           102.2

In [141]:
# print d3
print(d3)

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            59.0
1        Delhi           22   True            71.6
2       Kanpur           20  False            68.0
3      Chennai           26  False            78.8
4       Manali           -2  False            28.4
0    Bengaluru           24  False            75.2
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  Pondicherry           39   True           102.2

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [142]:
# write function here
def c_to_f(celsius):
    fahrenheit = (celsius * 9/5)+32
    return fahrenheit

c_to_f(10)

50.0

In [143]:
# check function c_to_f(10)
c_to_f(10)

50.0

In [144]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'
d3['temp_farenhiet']= d3['Temperature'].apply(c_to_f)
d3

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            59.0
1        Delhi           22   True            71.6
2       Kanpur           20  False            68.0
3      Chennai           26  False            78.8
4       Manali           -2  False            28.4
0    Bengaluru           24  False            75.2
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  Pondicherry           39   True           102.2

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [145]:
ut_cities = d3[d3['is_ut']]
print(ut_cities)

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            59.0
1        Delhi           22   True            71.6
3  Pondicherry           39   True           102.2

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [146]:
cities = d3[d3['temp_farenhiet']> 90][['city']]
print(cities)

          city
1   Coimbatore
2    Srirangam
3  Pondicherry

Select only the first three rows of the dataframe d1.

In [149]:
d3.iloc[:3]

         city  Temperature  is_ut  temp_farenhiet
0  Chandigarh           15   True            59.0
1       Delhi           22   True            71.6
2      Kanpur           20  False            68.0

Select all the rows and last two columns in the dataframe.

In [151]:
d3.iloc[:, 2:4]

   is_ut  temp_farenhiet
0   True            59.0
1   True            71.6
2  False            68.0
3  False            78.8
4  False            28.4
0  False            75.2
1  False            95.0
2  False            96.8
3   True           102.2

## Groupby

In [40]:
# Create a dataframe using dictionary of your choice

# data = 
data = pd.DataFrame({
    'Name': ['Avni', 'Depal','Mayur','Sam','Krunal','Rahul','Rakul','Sweety','Pooja','Rani'],
    'Age':[23,34,23,24,19,20,34,35,38,40,],
    'city':['Valsad','Vapi','Vapi','Daman','Daman','Valsad','Delhi','Delhi','Vapi','Vapi'],
    'result':['Pass','Fail','Fail','Pass','Fail','Pass','Fail','Pass','Fail','Fail']
})

data

     Name  Age    city result
0    Avni   23  Valsad   Pass
1   Depal   34    Vapi   Fail
2   Mayur   23    Vapi   Fail
3     Sam   24   Daman   Pass
4  Krunal   19   Daman   Fail
5   Rahul   20  Valsad   Pass
6   Rakul   34   Delhi   Fail
7  Sweety   35   Delhi   Pass
8   Pooja   38    Vapi   Fail
9    Rani   40    Vapi   Fail

In [43]:
# Use Groupby of single column with aggregate sum()
data.groupby('Name')[['result']].sum()

       result
Name
Avni     Pass
Depal    Fail
Krunal   Fail
Mayur    Fail
Pooja    Fail
Rahul    Pass
Rakul    Fail
Rani     Fail
Sam      Pass
Sweety   Pass

In [45]:
# Use Groupby of single column with aggregate count()

data.groupby('city')[['result']].count()

        result
city
Daman        2
Delhi        2
Valsad       2
Vapi         4

In [48]:
# Use Groupby of single column with aggregate min() and max()

data.groupby('city')[['result']].min()

       result
city
Daman    Fail
Delhi    Fail
Valsad   Pass
Vapi     Fail

In [49]:
data.groupby('city')[['result']].max()

       result
city
Daman    Pass
Delhi    Pass
Valsad   Pass
Vapi     Fail

In [53]:
# Use Groupby of any 2 columns with aggregate mean()
data.groupby(['Name','city'])[['Age']].mean()

                Age
Name   city
Avni   Valsad  23.0
Depal  Vapi    34.0
Krunal Daman   19.0
Mayur  Vapi    23.0
Pooja  Vapi    38.0
Rahul  Valsad  20.0
Rakul  Delhi   34.0
Rani   Vapi    40.0
Sam    Daman   24.0
Sweety Delhi   35.0

In [54]:
# Use Groupby of any 2 columns with aggregate min() and max()

data.groupby(['Name','city'])[['Age']].max()

               Age
Name   city
Avni   Valsad   23
Depal  Vapi     34
Krunal Daman    19
Mayur  Vapi     23
Pooja  Vapi     38
Rahul  Valsad   20
Rakul  Delhi    34
Rani   Vapi     40
Sam    Daman    24
Sweety Delhi    35

In [56]:
data.groupby(['Name','Age'])[['Age']].min()

            Age
Name   Age
Avni   23    23
Depal  34    34
Krunal 19    19
Mayur  23    23
Pooja  38    38
Rahul  20    20
Rakul  34    34
Rani   40    40
Sam    24    24
Sweety 35    35

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [30]:
# a = 
a = pd.date_range(start = '2020-01-01', end = '2021-04-01')

print a

In [31]:
a

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

What is the len of a?

In [32]:
print(len(a))

457

What is the type of a?

In [33]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex